
#ifndef _fdistr_h
#define _fdistr_h

#include "ap.h"

//#include "gammaf.h"
//#include "gammaln.h"
//#include "ibetaf.h"
//#include "normaldistr.h"
//#include "invibetaf.h"


/*************************************************************************
Интегральная функция вероятности F-распределения со степенями свободы a и b

Входные параметры:
    a,b -   степени свободы
    x   -   аргумент
    
Результат: P(F<=x|a,b)

Cephes Math Library Release 2.8:  June, 2000
Copyright 1984, 1987, 1995, 2000 by Stephen L. Moshier
*************************************************************************/
double fdistribution(int a, int b, double x);


/*************************************************************************
Дополнение интегральной функции вероятности F-распределения
со степенями свободы a и b до единицы

Входные параметры:
    a,b -   степени свободы
    x   -   аргумент

Результат: 1-P(F<=x|a,b)

Cephes Math Library Release 2.8:  June, 2000
Copyright 1984, 1987, 1995, 2000 by Stephen L. Moshier
*************************************************************************/
double fcdistribution(int a, int b, double x);


/*************************************************************************
Функция, обратная к интегральной функции вероятности F-распределения
со степенями свободы a и b

Алгоритм находит такое x, что P(F<=x|a,b)=y

Входные параметры:
    a,b -   степени свободы
    y   -   аргумент

Cephes Math Library Release 2.8:  June, 2000
Copyright 1984, 1987, 1995, 2000 by Stephen L. Moshier
*************************************************************************/
double invfdistribution(int a, int b, double y);


#endif
